---
kind: property
id: P:Autodesk.Revit.DB.BRepBuilderGeometryId.IsValidObject
source: html/f7b9d61f-8ae6-5601-0195-0103f13b7953.htm
---
# Autodesk.Revit.DB.BRepBuilderGeometryId.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.